Tekla Open API Reference for Tekla Structures 2025
WpfFilterCheckBox.AttributeName Property
 Dialog attribute name defined with StructuresFieldAttribute
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string AttributeName { get; set; }
Public Property AttributeName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
WpfFilterCheckBox Class
Tekla.Structures.Dialog.UIControls Namespace